memtier/performance/data/armorix/strong-1.out
12        Threads
50        Connections per thread
50        Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets        88411.61          ---          ---         0.62766         0.60700         1.21500         1.23900         1.62300      6034.31 
Gets       884056.22       347.26    883708.96         0.61511         0.59100         1.20700         1.22300         1.57500     22371.05 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals     972467.83       347.26    883708.96         0.61625         0.59900         1.20700         1.22300         1.57500     28405.36 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.087        0.000
SET       0.567        5.000
SET       0.575       10.000
SET       0.583       15.000
SET       0.583       20.000
SET       0.591       25.000
SET       0.591       30.000
SET       0.599       35.000
SET       0.599       40.000
SET       0.599       45.000
SET       0.607       50.000
SET       0.607       52.500
SET       0.607       55.000
SET       0.607       57.500
SET       0.615       60.000
SET       0.615       62.500
SET       0.615       65.000
SET       0.615       67.500
SET       0.623       70.000
SET       0.623       72.500
SET       0.623       75.000
SET       0.623       76.250
SET       0.631       77.500
SET       0.631       78.750
SET       0.631       80.000
SET       0.631       81.250
SET       0.631       82.500
SET       0.639       83.750
SET       0.639       85.000
SET       0.639       86.250
SET       0.647       87.500
SET       0.647       88.125
SET       0.647       88.750
SET       0.647       89.375
SET       0.647       90.000
SET       0.655       90.625
SET       0.655       91.250
SET       0.655       91.875
SET       0.663       92.500
SET       0.663       93.125
SET       0.671       93.750
SET       0.671       94.062
SET       0.679       94.375
SET       0.687       94.688
SET       0.695       95.000
SET       0.703       95.312
SET       0.719       95.625
SET       0.759       95.938
SET       0.815       96.250
SET       1.127       96.562
SET       1.151       96.875
SET       1.159       97.031
SET       1.159       97.188
SET       1.167       97.344
SET       1.175       97.500
SET       1.175       97.656
SET       1.183       97.812
SET       1.183       97.969
SET       1.191       98.125
SET       1.191       98.281
SET       1.199       98.438
SET       1.199       98.516
SET       1.199       98.594
SET       1.207       98.672
SET       1.207       98.750
SET       1.207       98.828
SET       1.207       98.906
SET       1.215       98.984
SET       1.215       99.062
SET       1.215       99.141
SET       1.223       99.219
SET       1.223       99.258
SET       1.223       99.297
SET       1.223       99.336
SET       1.231       99.375
SET       1.231       99.414
SET       1.231       99.453
SET       1.231       99.492
SET       1.239       99.531
SET       1.239       99.570
SET       1.239       99.609
SET       1.247       99.629
SET       1.247       99.648
SET       1.247       99.668
SET       1.247       99.688
SET       1.255       99.707
SET       1.255       99.727
SET       1.255       99.746
SET       1.263       99.766
SET       1.271       99.785
SET       1.271       99.805
SET       1.279       99.814
SET       1.279       99.824
SET       1.287       99.834
SET       1.295       99.844
SET       1.303       99.854
SET       1.319       99.863
SET       1.335       99.873
SET       1.375       99.883
SET       1.463       99.893
SET       1.711       99.902
SET       1.935       99.907
SET       2.143       99.912
SET       2.351       99.917
SET       2.575       99.922
SET       2.783       99.927
SET       2.975       99.932
SET       3.183       99.937
SET       3.391       99.941
SET       3.615       99.946
SET       3.823       99.951
SET       3.919       99.954
SET       4.015       99.956
SET       4.159       99.958
SET       4.255       99.961
SET       4.319       99.963
SET       4.415       99.966
SET       4.543       99.968
SET       4.639       99.971
SET       4.767       99.973
SET       4.863       99.976
SET       4.895       99.977
SET       4.927       99.978
SET       4.959       99.979
SET       4.991       99.980
SET       5.055       99.982
SET       5.087       99.983
SET       5.151       99.984
SET       5.183       99.985
SET       5.247       99.987
SET       5.279       99.988
SET       5.311       99.988
SET       5.343       99.989
SET       5.343       99.990
SET       5.407       99.990
SET       5.407       99.991
SET       5.439       99.991
SET       5.471       99.992
SET       5.471       99.993
SET       5.503       99.993
SET       5.535       99.994
SET       5.535       99.994
SET       5.567       99.995
SET       5.567       99.995
SET       5.567       99.995
SET       5.599       99.995
SET       5.599       99.996
SET       5.631       99.996
SET       5.631       99.996
SET       5.663       99.997
SET       5.663       99.997
SET       5.695       99.997
SET       5.695       99.997
SET       5.695       99.997
SET       5.727       99.998
SET       5.727       99.998
SET       5.727       99.998
SET       5.759       99.998
SET       5.759       99.998
SET       5.759       99.998
SET       5.791       99.998
SET       5.823       99.999
SET       5.823       99.999
SET       5.823       99.999
SET       5.855       99.999
SET       5.855       99.999
SET       5.855       99.999
SET       5.887       99.999
SET       5.887       99.999
SET       5.919       99.999
SET       5.951       99.999
SET       5.951       99.999
SET       6.015       99.999
SET       6.015       99.999
SET       6.047       99.999
SET       6.047       99.999
SET       6.047       99.999
SET       6.047      100.000
SET       6.079      100.000
SET       6.079      100.000
SET       6.111      100.000
SET       6.111      100.000
SET       6.143      100.000
SET       6.143      100.000
SET       6.175      100.000
SET       6.175      100.000
SET       6.175      100.000
[...]
SET       6.207      100.000
SET       6.207      100.000
SET       6.207      100.000
[...]
SET       6.239      100.000
SET       6.239      100.000
SET       6.239      100.000
[...]
SET       6.271      100.000
SET       6.271      100.000
SET       6.271      100.000
SET       6.303      100.000
SET       6.303      100.000
SET       6.303      100.000
[...]
SET       6.335      100.000
SET       6.335      100.000
SET       6.335      100.000
[...]
SET       6.399      100.000
SET       6.399      100.000
SET       6.399      100.000
[...]
SET       6.527      100.000
SET       6.527      100.000
---
GET       0.079        0.000
GET       0.551        5.000
GET       0.559       10.000
GET       0.567       15.000
GET       0.575       20.000
GET       0.575       25.000
GET       0.583       30.000
GET       0.583       35.000
GET       0.591       40.000
GET       0.591       45.000
GET       0.591       50.000
GET       0.599       52.500
GET       0.599       55.000
GET       0.599       57.500
GET       0.599       60.000
GET       0.599       62.500
GET       0.607       65.000
GET       0.607       67.500
GET       0.607       70.000
GET       0.607       72.500
GET       0.615       75.000
GET       0.615       76.250
GET       0.615       77.500
GET       0.615       78.750
GET       0.615       80.000
GET       0.623       81.250
GET       0.623       82.500
GET       0.623       83.750
GET       0.623       85.000
GET       0.623       86.250
GET       0.631       87.500
GET       0.631       88.125
GET       0.631       88.750
GET       0.631       89.375
GET       0.631       90.000
GET       0.639       90.625
GET       0.639       91.250
GET       0.639       91.875
GET       0.639       92.500
GET       0.647       93.125
GET       0.647       93.750
GET       0.655       94.062
GET       0.655       94.375
GET       0.655       94.688
GET       0.663       95.000
GET       0.663       95.312
GET       0.671       95.625
GET       0.687       95.938
GET       0.735       96.250
GET       1.119       96.562
GET       1.143       96.875
GET       1.143       97.031
GET       1.151       97.188
GET       1.159       97.344
GET       1.159       97.500
GET       1.167       97.656
GET       1.175       97.812
GET       1.175       97.969
GET       1.183       98.125
GET       1.183       98.281
GET       1.191       98.438
GET       1.191       98.516
GET       1.191       98.594
GET       1.191       98.672
GET       1.199       98.750
GET       1.199       98.828
GET       1.199       98.906
GET       1.207       98.984
GET       1.207       99.062
GET       1.207       99.141
GET       1.215       99.219
GET       1.215       99.258
GET       1.215       99.297
GET       1.215       99.336
GET       1.223       99.375
GET       1.223       99.414
GET       1.223       99.453
GET       1.223       99.492
GET       1.231       99.531
GET       1.231       99.570
GET       1.231       99.609
GET       1.239       99.629
GET       1.239       99.648
GET       1.239       99.668
GET       1.239       99.688
GET       1.247       99.707
GET       1.247       99.727
GET       1.247       99.746
GET       1.255       99.766
GET       1.255       99.785
GET       1.263       99.805
GET       1.263       99.814
GET       1.271       99.824
GET       1.271       99.834
GET       1.279       99.844
GET       1.287       99.854
GET       1.303       99.863
GET       1.327       99.873
GET       1.359       99.883
GET       1.431       99.893
GET       1.639       99.902
GET       1.839       99.907
GET       2.063       99.912
GET       2.271       99.917
GET       2.479       99.922
GET       2.687       99.927
GET       2.911       99.932
GET       3.119       99.937
GET       3.327       99.941
GET       3.519       99.946
GET       3.743       99.951
GET       3.839       99.954
GET       3.951       99.956
GET       4.063       99.958
GET       4.191       99.961
GET       4.287       99.963
GET       4.383       99.966
GET       4.479       99.968
GET       4.575       99.971
GET       4.671       99.973
GET       4.767       99.976
GET       4.831       99.977
GET       4.863       99.978
GET       4.927       99.979
GET       4.959       99.980
GET       5.023       99.982
GET       5.087       99.983
GET       5.119       99.984
GET       5.183       99.985
GET       5.215       99.987
GET       5.247       99.988
GET       5.279       99.988
GET       5.311       99.989
GET       5.343       99.990
GET       5.375       99.990
GET       5.375       99.991
GET       5.407       99.991
GET       5.439       99.992
GET       5.439       99.993
GET       5.471       99.993
GET       5.503       99.994
GET       5.503       99.994
GET       5.535       99.995
GET       5.535       99.995
GET       5.535       99.995
GET       5.567       99.995
GET       5.567       99.996
GET       5.567       99.996
GET       5.599       99.996
GET       5.599       99.997
GET       5.631       99.997
GET       5.631       99.997
GET       5.663       99.997
GET       5.663       99.997
GET       5.663       99.998
GET       5.663       99.998
GET       5.695       99.998
GET       5.695       99.998
GET       5.695       99.998
GET       5.727       99.998
GET       5.759       99.998
GET       5.759       99.999
GET       5.759       99.999
GET       5.791       99.999
GET       5.791       99.999
GET       5.823       99.999
GET       5.823       99.999
GET       5.855       99.999
GET       5.855       99.999
GET       5.887       99.999
GET       5.887       99.999
GET       5.919       99.999
GET       5.919       99.999
GET       5.919       99.999
GET       5.951       99.999
GET       5.951       99.999
GET       5.951       99.999
GET       5.983      100.000
GET       5.983      100.000
GET       6.015      100.000
GET       6.015      100.000
GET       6.047      100.000
GET       6.047      100.000
GET       6.047      100.000
GET       6.079      100.000
GET       6.079      100.000
GET       6.079      100.000
GET       6.111      100.000
GET       6.111      100.000
GET       6.143      100.000
GET       6.143      100.000
GET       6.143      100.000
GET       6.175      100.000
GET       6.175      100.000
GET       6.175      100.000
[...]
GET       6.207      100.000
GET       6.207      100.000
GET       6.207      100.000
[...]
GET       6.239      100.000
GET       6.239      100.000
GET       6.239      100.000
[...]
GET       6.271      100.000
GET       6.271      100.000
GET       6.271      100.000
[...]
GET       6.303      100.000
GET       6.303      100.000
GET       6.303      100.000
[...]
GET       6.335      100.000
GET       6.335      100.000
GET       6.335      100.000
[...]
GET       6.367      100.000
GET       6.367      100.000
GET       6.367      100.000
GET       6.399      100.000
GET       6.399      100.000
GET       6.399      100.000
GET       6.431      100.000
GET       6.431      100.000
GET       6.431      100.000
[...]
GET       6.463      100.000
GET       6.463      100.000
GET       6.463      100.000
[...]
GET       6.495      100.000
GET       6.495      100.000
---
WAIT      0.000      100.000